{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "books": [
    {
      "author": "Michael Chabon",
      "title": "Moonglow",
      "description": "Moonglow is a 2016 novel by Michael Chabon. The book chronicles the life of Chabon's grandfather, a WW2 soldier, engineer and rocket enthusiast who marries a troubled Jewish survivor from France and lives a challenging, wandering life in postwar America. Chabon tells the story using a mixture of strict memoir and creative fiction writing.[1] The narrator functions as a proxy for the author, Chabon.[1][2]",
      "years": 2016,
      "rating": [
        7
      ],
      "url": "https://upload.wikimedia.org/wikipedia/en/0/03/Moonglow_cover.jpg",
      "id": 1
    },
    {
      "author": "Zadie Smith",
      "title": "White Teeth",
      "description": "White Teeth is a 2000 novel by the British author Zadie Smith. It focuses on the later lives of two wartime friends—the Bangladeshi Samad Iqbal and the Englishman Archie Jones—and their families in London. The novel centres on Britain's relationship with immigrants from the British Commonwealth.[2]",
      "years": 2020,
      "rating": [
        10,
        10,
        7,
        10,
        10
      ],
      "url": "https://upload.wikimedia.org/wikipedia/en/1/1f/WhiteTeeth.jpg",
      "id": 2
    },
    {
      "author": "Adam Mickiewicz",
      "title": "Pan Tadeusz ",
      "description": "asld dlsfk sdfkl ldksfkldsfk kdfsl kf ksd",
      "years": 2022,
      "rating": [
        5,
        10,
        10,
        1,
        1,
        1
      ],
      "url": "https://s.lubimyczytac.pl/upload/books/4936000/4936657/836580-170x243.jpg",
      "id": 4
    },
    {
      "author": "Mikhail Afanasyevich Bulgakov",
      "title": "The Master and Margarita",
      "description": "The Master and Margarita (Russian: Мастер и Маргарита) is a novel by Soviet writer Mikhail Bulgakov, written in the Soviet Union between 1928 and 1940 during Stalin's regime. A censored version, with several chapters cut by editors, was published in Moscow magazine in 1966–1967, after the writer's death, by his widow. The manuscript was not published as a book until 1967, in Paris. A samizdat version circulated that included parts cut out by official censors, and these were incorporated in a 1969 version published in Frankfurt. The novel has since been published in several languages and editions.",
      "years": 1967,
      "rating": [
        9
      ],
      "url": "https://ecsmedia.pl/c/the-master-and-margarita-w-iext69905138.jpg",
      "id": 5
    },
    {
      "author": "Blanka Lipińska",
      "title": "365 dni",
      "description": "Powieść była nominowana do nagrody Bestsellery Empiku w kategorii literatura polska[1][2]. Książka rozeszła się w nakładzie ponad 100 tys. egzemplarzy[3].\n\nPowieść została zekranizowana, a film 365 dni wyreżyserowała Barbara Białowąs. Premiera filmu odbyła się w 2020, a główne role zagrali w niej Anna-Maria Sieklucka jako Laura Biel i Michele Morrone jako Don Massimo Torricelli. Film był najczęściej oglądaną polską produkcją w kinach w 2020, za co został nagrodzony Bursztynowymi Lwami podczas 45. Festiwalu Polskich Filmów Fabularnych w Gdyni[4]. Po międzynarodowej premierze na Netflixie ekranizacja była najpopularniejszym filmem na tej platformie w 2020[5].",
      "years": 2016,
      "rating": [
        5,
        10
      ],
      "url": "https://ecsmedia.pl/c/365-dni-w-iext115627841.jpg",
      "id": 6
    },
    {
      "author": "Zadie Smith",
      "title": "White Teeth",
      "description": "White Teeth is a 2000 novel by the British author Zadie Smith. It focuses on the later lives of two wartime friends—the Bangladeshi Samad Iqbal and the Englishman Archie Jones—and their families in London. The novel centres on Britain's relationship with immigrants from the British Commonwealth.[2]",
      "years": 2000,
      "rating": [
        5,
        8
      ],
      "url": "https://en.wikipedia.org/wiki/White_Teeth#/media/File:WhiteTeeth.jpg",
      "id": 14
    }
  ],
  "author": [
    {
      "id": 1,
      "author": "Adam Mickiewicz",
      "bio": "Polski poeta, działacz polityczny, publicysta, tłumacz, filozof, działacz religijny, mistyk, organizator i dowódca wojskowy, nauczyciel akademicki."
    },
    {
      "id": 3,
      "author": "Henryk sienkiewicz",
      "bio": "Herbu Oszyk, pseudonim „Litwos”, „Musagetes”, „Juliusz Polkowski”, „K. Dobrzyński” – polski nowelista, powieściopisarz i publicysta; laureat Nagrody Nobla w dziedzinie literatury za całokształt twórczości, jeden z najpopularniejszych polskich pisarzy przełomu XIX i XX w."
    },
    {
      "id": 2,
      "author": "Bolesław Prus",
      "bio": "Polski pisarz, prozaik, nowelista i publicysta okresu pozytywizmu, współtwórca polskiego realizmu, kronikarz Warszawy, myśliciel i popularyzator wiedzy, działacz społeczny, propagator turystyki pieszej i rowerowej. Jeden z najwybitniejszych i najważniejszych pisarzy w historii literatury polskiej."
    },
    {
      "author": "Jan Kochanowski",
      "bio": "Dokładna data urodzenia Jana Kochanowskiego nie jest znana. Większość badaczy wskazuje na 1530 rok[b]. Ojcem był Piotr Kochanowski herbu Korwin, komornik graniczny radomski i sędzia ziemski sandomierski a matką – Anna, córka Jakuba Białaczowskiego herbu Odrowąż z Dąbrówki Podlężnej. Z małżeństwa Piotra i Anny urodziło się jedenaścioro dzieci – cztery córki (Katarzyna, Elżbieta, Jadwiga, Anna) i siedmiu synów (Kasper, Jan, Piotr, Mikołaj – poeta, Andrzej – tłumacz Eneidy Wergiliusza, Jakub, Stanisław)[13]. Bratanek Jana Kochanowskiego, Piotr Kochanowski, przełożył Orlanda szalonego Ludovico Ariosta i Jerozolimę wyzwoloną Torquato Tassa.",
      "id": 4
    },
    {
      "author": "",
      "bio": "Brak informacji o ",
      "id": 5
    },
    {
      "author": "Michael Chabon",
      "bio": "Michael Chabon was born in 1963, in Washington, D.C. and raised mostly in Columbia, a planned city with utopian aspirations in the Maryland tobacco country. He studied at Carnegie-Mellon and the University of Pittsburgh, received an M.F.A. in Creative Writing at UC Irvine, and has spent most of the past two decades in California, with brief sojourns in Washington State, Florida, and New York State. Since 1997, he has been living with his wife, Ayelet Waldman, also a writer, and their children, in Berkeley.",
      "id": 6
    },
    {
      "author": "Blanka Lipińska",
      "bio": "Urodziła i wychowywała się w Puławach[2]. Jest córką Grzegorza i Małgorzaty[3]. Ma starszego o rok brata Jakuba[2].\n\nJest absolwentką Liceum Ogólnokształcącego nr VI Zespołu Szkół nr 3 w Puławach. Po maturze uczyła się w studium kosmetycznym, po którego ukończeniu została wizażystką. W 2007 przeprowadziła się do Warszawy, gdzie pracowała jako specjalistka i menedżerka w działach sprzedaży i marketingu firm z branży hotelarskiej. W 2012 dołączyła do federacji KSW, w której zajmowała się rekrutacją i szkoleniem tzw. „ring girls”, czyli kobiet, które wchodzą na ring między rundami walk. Równolegle w latach 2015–2016 była menedżerką odpowiedzialną za rezerwacje w nocnych klubach w Sopocie: The Roof, Show, Dream Club, The Star. W 2016 przeprowadziła się do Poznania[6], a rok później zamieszkała w Al-Dżunie w Egipcie. W 2018 wróciła do Warszawy, a rok później odeszła z KSW.",
      "id": 7
    },
    {
      "author": "Zadie Smith",
      "bio": "Zadie Smith, originally Sadie Smith, (born October 27, 1975, London, England), British author known for her treatment of race, religion, and cultural identity and for her novels’ eccentric characters, savvy humour, and snappy dialogue. She became a sensation in the literary world with the publication of her first novel, White Teeth, in 2000.",
      "id": 8
    },
    {
      "author": "Peter V. Brett ",
      "bio": "amerykański pisarz fantasy. Autor cyklu demonicznego, który rozpoczął wydanym w 2008 roku tomem Malowany człowiek. Od dzieciństwa był fanem fantastyki, komiksów i gier fabularnych. W 1995 roku ukończył literaturę angielską i historię sztuki na Uniwersytecie Buffalo",
      "id": 9
    },
    {
      "author": "Stanisław Lem",
      "bio": "(ur. 12 lub 13 września 1921 we Lwowie, zm. 27 marca 2006 w Krakowie[2]) – polski pisarz gatunku hard science fiction, filozof, futurolog oraz krytyk.\n\nJego debiutem książkowym była wydana w 1951 roku powieść Astronauci. Kolejne powieści fantastycznonaukowe jego autorstwa to: Obłok Magellana (1955), Eden (1959), Pamiętnik znaleziony w wannie (1961), Powrót z gwiazd (1961), Solaris (1961), Niezwyciężony (1964), Głos Pana (1968), Wizja lokalna (1982), Fiasko (1987) i Pokój na Ziemi (1987). Był również autorem trylogii Czas nieutracony (1955) oraz cykli opowiadań fantastycznonaukowych: Dzienniki gwiazdowe (1957), Księga robotów (1961), Bajki robotów (1964), Cyberiada (1965), Opowieści o pilocie Pirxie (1968). Napisał recenzje nieistniejących książek (Doskonała próżnia, 1971), a także wstępy do nieistniejących dzieł (Wielkość urojona, 1973). Jest autorem zbiorów esejów, felietonów i publicystyki literackiej, w tym: Wejście na orbitę (1962), Summa technologiae (1964), Filozofia przypadku (1968), Fantastyka i futurologia (1970), Rozprawy i szkice (1975).",
      "id": 10
    },
    {
      "author": "Zbigniew Herbert",
      "bio": " (ur. 29 października 1924 we Lwowie, zm. 28 lipca 1998 w Warszawie) – polski poeta, eseista, dramaturg, twórca cyklu poetyckiego „Pan Cogito”, autor słuchowisk; pośmiertnie odznaczony Orderem Orła Białego. Z wykształcenia ekonomista, prawnik i filozof.",
      "id": 11
    },
    {
      "author": "Mikhail Afanasyevich Bulgakov",
      "bio": "Mikhail Afanasyevich Bulgakov (Russian: Михаил Афанасьевич Булгаков, IPA: [mʲɪxɐˈil ɐfɐˈnasʲjɪvʲɪdʑ bʊlˈɡakəf];[2] 15 May [O.S. 3 May] 1891 – 10 March 1940) was a Russian, later Soviet writer, medical doctor, and playwright active in the first half of the 20th century.[1] He is best known for his novel The Master and Margarita, published posthumously, which has been called one of the masterpieces of the 20th century.[3]",
      "id": 12
    },
    {
      "author": "Zadie Smith",
      "bio": "Zadie Smith (ur. 25 października 1975 w Londynie) – brytyjska pisarka, autorka opowiadań i powieści. Ukończyła King's College w Cambridge, członkini The Royal Society of Literature (RSL). (https://pl.wikipedia.org/wiki/Zadie_Smith)",
      "id": 13
    }
  ]
}